app/views/items/_form.html.erb

SELECT "categories".* FROM "categories"
---
  <%= form.label :category %><br>
  <%= form.select :category_id, Category.all.collect{|c| [c.name, c.id] },{}, {class: "custom-select"} %>