app/views/items/_item_rating.html.erb

        <h3 class="text-center">Top Comments</h3>
        <% @item.ratings.each do |rating| %>
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."item_id" = ?  [["item_id", 1]]