app/controllers/announcements_controller.rb

SELECT "announcements".* FROM "announcements" WHERE (category = 1) ORDER BY "announcements"."updated_at" ASC
---
    def index
        @announcement = Announcement.all.order(updated_at: :desc)

SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 298486374], ["LIMIT", 1]]
---
    def edit
        @announcement = Announcement.find(params[:id])

SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 169552531], ["LIMIT", 1]]
---
    def show
        @announcement = Announcement.all.order(updated_at: :desc)
        @announcement_details = Announcement.find(params[:id])

SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 298486374], ["LIMIT", 1]]
---
    def update
        @announcement = Announcement.find(params[:id])

SELECT  "announcements".* FROM "announcements" WHERE "announcements"."id" = ? LIMIT ?  [["id", 298486374], ["LIMIT", 1]]
DELETE FROM "announcements" WHERE "announcements"."id" = ?  [["id", 298486374]]
---
    def destroy
        @announcement = Announcement.find(params[:id])
        @announcement.destroy