app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
 			@categories = Category.all
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "can create"], ["created_at", "2018-12-02 22:49:46.543759"], ["updated_at", "2018-12-02 22:49:46.543759"]]
SELECT "categories".* FROM "categories"

  def update
    @category = Category.find(params[:id])

    if @category.update(category_params)
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 169552531], ["LIMIT", 1]]
UPDATE "categories" SET "name" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["name", "edit category"], ["updated_at", "2018-12-03 05:42:42.589945"], ["id", 169552531]]

  def destroy
    @category = Category.find(params[:id])
    @category.destroy
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 169552531], ["LIMIT", 1]]
DELETE FROM "categories" WHERE "categories"."id" = ?  [["id", 169552531]]