app/controllers/friends_controller.rb

SELECT "friends"."target_id" FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 110237153]]
SELECT "users".* FROM "users" WHERE 1=1
---
def new
    @friend = Friend.new
    arr = current_user.friends.select(:target_id).to_a.map{|row| row.target_id}
    @targets = User.all.where.not(id:arr)

SELECT "users".* FROM "users"
---
  def create
    @targets = User.all

SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 298486374], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 110237153], ["LIMIT", 1]]
---
def show
@friend = Friend.find(params[:id])
@friend_obj = User.find(@friend.target_id)