app/controllers/items_controller.rb

  def index
    @items = Item.where(:user_id => current_user).paginate(:page => params[:page],:per_page => 10)
---
SELECT  "items".* FROM "items" WHERE "items"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 110237153], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items" WHERE "items"."user_id" = ?  [["user_id", 110237153]]

  def edit
    @action = "edit"
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    @item = Item.find(params[:id])
   @item.destroy
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = ?  [["id", 1]]