app/controllers/marketplaces_controller.rb

SELECT  "items".* FROM "items" ORDER BY name LIMIT ? OFFSET ?  [["LIMIT", 4], ["OFFSET", 0]]
SELECT COUNT(*) FROM "items"
---
    def index
        @friend = false
        #list all items in the transaction record
        @displayItems = Item.filter(params).friends(params).search(params).paginate(:page => params[:page], :per_page => 4)

SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "transactions"."start_date", "transactions"."end_date" FROM "transactions" WHERE ((status = 2 OR status = 3) AND (item_id = 1))
SELECT "ratings".* FROM "ratings" WHERE "ratings"."item_id" = ?  [["item_id", 1]]
SELECT COUNT(*) FROM "ratings" WHERE "ratings"."item_id" = ? AND "ratings"."score" = ?  [["item_id", 16], ["score", 5]]
---
    def show
        #pass in the item id contained in the transaction record
        @item = Item.find_by(id: params[:id])
        @unavailable_times = Transaction.where("(status = ? OR status = ?) AND (item_id = ?)", Transaction::IN_PROGRESS, Transaction::ACCEPTED, @item.id).select(:start_date, :end_date)
        class << @item
            attr_accessor :stars, :blank_stars, :average
        end
        ratingArr = []
        for rating in @item.ratings
            ratingArr.push(rating.score)
        end
        if ratingArr.size > 0
            @item.average = ratingArr.sum/ratingArr.size.to_f