app/controllers/profiles_controller.rb

SELECT AVG("uratings"."score") FROM "uratings" WHERE "uratings"."user_id" = ?  [["user_id", 110237153]]
---
    def show
      @average = current_user.uratings.average(:score)